run/porousPimpleFoam/validation/testUReconMethods/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

x0  0;
x1  8;
y0  0;
y1  1;
z0  0;
z1  1;

vertices
(
    //x y z
    ($x0 $y0 $z0)
    ($x1 $y0 $z0)
    ($x1 $y1 $z0)
    ($x0 $y1 $z0)
    ($x0 $y0 $z1)
    ($x1 $y0 $z1)
    ($x1 $y1 $z1)
    ($x0 $y1 $z1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 10 1) simpleGrading (1 1 1)
);

patches
(
    wall leftWall
    (
        (0 4 3 7)
    )
    wall rightWall
    (
        (1 2 6 5)
    )
    wall lowerWall
    (
        (0 1 5 4)
    )
    patch atmosphere
    (
        (2 3 7 6)
    )
);


// ************************************************************************* //
