run/porousPimpleFoam/validation/testUReconMethods/baseCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        isoFaceTol      1e-06;
        surfCellTol     1e-06;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;
        reconstructionScheme isoAlpha;
        nAlphaSubCycles 1;
        cAlpha          1;
    }
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
    }
    pcorrFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
    }
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
    }
    p_rghFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
    U
    {
        solver          PBiCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
    UFinal
    {
        solver          PBiCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
    Tf
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    Ts
    {
        solver          PBiCGStab;
        preconditioner  none;
        tolerance       1e-06;
        relTol          0.1;
    }
    TfFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    TsFinal
    {
        solver          PBiCGStab;
        preconditioner  none;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    UReconMethod    standard;
    UReconCorrect1stIter true;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"            1;
    }
}


// ************************************************************************* //
